
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>手搓数据结构 · Mr.Zhou</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="周默">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-nvigation/nav.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="../styles/website.css">
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="../" />
    

    
        <link rel="shortcut icon" href='../styles/GitHub.png' type="image/x-icon">
    
    
        <link rel="bookmark" href='../styles/GitHub.png' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='../styles/GitHub.png'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="../styles/GitHub.png">
        
        <link rel="apple-touch-icon" sizes="180x180" href="../styles/GitHub.png">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    wyfyjc.com
            
                </a>
            

            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter active" data-level="2.1" data-path="./">
            
                <a href="./">
            
                    
                    手搓数据结构
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >手搓数据结构</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h1>
<p>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x82F1;&#x8BED;&#xFF1A;data structure&#xFF09;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x5B58;&#x50A8;&#x3001;&#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x610F;&#x5473;&#x7740;&#x4ECB;&#x9762;&#x6216;&#x5C01;&#x88C5;&#xFF1A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x88AB;&#x89C6;&#x4E3A;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x4ECB;&#x9762;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x7531;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8054;&#x5408;&#x7EC4;&#x6210;&#x7684;&#x5B58;&#x50A8;&#x5185;&#x5BB9;&#x7684;&#x8BBF;&#x95EE;&#x65B9;&#x6CD5;&#x5C01;&#x88C5;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x90FD;&#x7531;&#x6570;&#x5217;&#x3001;&#x8BB0;&#x5F55;&#x3001;&#x53EF;&#x8FA8;&#x8BC6;&#x8054;&#x5408;&#x3001;&#x5F15;&#x7528;&#x7B49;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x6784;&#x6210;&#x3002;&#x4E3E;&#x4F8B;&#x800C;&#x8A00;&#xFF0C;&#x53EF;&#x4E3A;&#x7A7A;&#x7684;&#x5F15;&#x7528;&#xFF08;nullable reference&#xFF09;&#x662F;&#x5F15;&#x7528;&#x4E0E;&#x53EF;&#x8FA8;&#x8BC6;&#x8054;&#x5408;&#x7684;&#x7ED3;&#x5408;&#x4F53;&#xFF0C;&#x800C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x94FE;&#x5F0F;&#x7ED3;&#x6784;&#x94FE;&#x8868;&#x5219;&#x662F;&#x7531;&#x8BB0;&#x5F55;&#x4E0E;&#x53EF;&#x7A7A;&#x5F15;&#x7528;&#x6784;&#x6210;&#x3002;</p>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x900F;&#x8FC7;&#x7A0B;&#x5F0F;&#x8BED;&#x8A00;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3001;&#x5F15;&#x7528;&#x53CA;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#x52A0;&#x4EE5;&#x5B9E;&#x73B0;&#x3002;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5E94;&#x8BE5;&#x5728;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x8F83;&#x5C11;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x7A7A;&#x95F4;&#x8D44;&#x6E90;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x652F;&#x63F4;&#x5404;&#x79CD;&#x7A0B;&#x5F0F;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E0D;&#x540C;&#x79CD;&#x7C7B;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x9002;&#x5408;&#x4E0D;&#x540C;&#x79CD;&#x7C7B;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x90E8;&#x5206;&#x8D44;&#x6599;&#x7ED3;&#x6784;&#x751A;&#x81F3;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x800C;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x7684;&#x3002;&#x4F8B;&#x5982; B &#x6811;&#x5373;&#x4E3A;&#x52A0;&#x5FEB;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x5B58;&#x53D6;&#x901F;&#x5EA6;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x8D44;&#x6599;&#x7ED3;&#x6784;&#xFF0C;&#x5E38;&#x88AB;&#x5E94;&#x7528;&#x5728;&#x8D44;&#x6599;&#x5E93;&#x548C;&#x6863;&#x6848;&#x7CFB;&#x7EDF;&#x4E0A;&#x3002;</p>
<p>&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x9009;&#x62E9;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x6F14;&#x7B97;&#x6CD5;&#x7684;&#x6548;&#x7387;&#xFF08;&#x8BF7;&#x53C2;&#x8003;&#x6F14;&#x7B97;&#x6CD5;&#x6548;&#x7387;&#xFF08;&#x82F1;&#x8BED;&#xFF1A;algorithmic efficiency&#xFF09;&#xFF09;&#x3002;&#x5728;&#x7535;&#x8111;&#x7A0B;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9009;&#x62E9;&#x9002;&#x5F53;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x4E00;&#x9879;&#x91CD;&#x8981;&#x5DE5;&#x4F5C;&#x3002;&#x8BB8;&#x591A;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x7F16;&#x5199;&#x7ECF;&#x9A8C;&#x663E;&#x793A;&#xFF0C;&#x7A0B;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x56F0;&#x96BE;&#x7A0B;&#x5EA6;&#x4E0E;&#x6700;&#x7EC8;&#x6210;&#x679C;&#x7684;&#x8D28;&#x91CF;&#x4E0E;&#x8868;&#x73B0;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x662F;&#x5426;&#x9009;&#x62E9;&#x4E86;&#x6700;&#x9002;&#x5408;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#x662F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x800C;&#x975E;&#x7B97;&#x6CD5;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x5BFC;&#x81F4;&#x4E86;&#x591A;&#x79CD;&#x5F62;&#x5F0F;&#x5316;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x4E0E;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x51FA;&#x73B0;&#x3002;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x8BED;&#x8A00;&#x90FD;&#x5E26;&#x6709;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x7684;&#x6A21;&#x5757;&#x5316;&#x601D;&#x60F3;&#xFF0C;&#x900F;&#x8FC7;&#x5C06;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x5C01;&#x88C5;&#x9690;&#x85CF;&#x4E8E;&#x4F7F;&#x7528;&#x8005;&#x4ECB;&#x9762;&#x4E4B;&#x540E;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6765;&#x8BA9;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x5B89;&#x5168;&#x5730;&#x91CD;&#x7528;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002; C++&#x3001;Java&#x3001;Python &#x7B49; &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53EF;&#x4F7F;&#x7528;&#x7C7B; (&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;) &#x6765;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6982;&#x5FF5;&#x7684;&#x666E;&#x53CA;&#xFF0C;&#x73B0;&#x4EE3;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53CA;&#x5176; API &#x4E2D;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x591A;&#x79CD;&#x9884;&#x8BBE;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4F8B;&#x5982; C++ &#x6807;&#x51C6;&#x6A21;&#x677F;&#x5E93;&#x4E2D;&#x7684;&#x5BB9;&#x5668;&#x3001; Java &#x96C6;&#x5408;&#x6846;&#x67B6;&#x4EE5;&#x53CA;&#x5FAE;&#x8F6F;&#x7684;. NET Framework&#x3002;</p>
<p><strong>&#x4E0A;&#x8FF0;&#x4ECB;&#x7ECD;&#x5F15;&#x7528;&#x81EA;&#x7EF4;&#x57FA;&#x767E;&#x79D1;</strong>&#xFF0C;&#x8FD9;&#x91CC;&#x505A;&#x4E00;&#x70B9;&#x4E2A;&#x4EBA;&#x7684;&#x7406;&#x89E3;&#x3002;<strong>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x7406;&#x8BBA;&#x5B66;&#x4E60;&#xFF0C;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x52A0;&#x4EE5;&#x5B9E;&#x73B0;&#x4E0E;&#x5E94;&#x7528;&#xFF0C;&#x5982;&#x6B64;&#x624D;&#x662F;&#x771F;&#x7684;&#x7406;&#x89E3;&#x4E86;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x91CD;&#x8981;&#x4E0E;&#x9B45;&#x529B;</strong>&#x3002;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7684;&#x672B;&#x5C3E;&#x63D0;&#x5230;&#x4E86; Java &#x7684;&#x96C6;&#x5408;&#x6846;&#x67B6;&#xFF0C;&#x8FD9;&#x91CC;&#xFF0C;&#x4E5F;&#x662F;&#x901A;&#x8FC7; Java &#x4E2D;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7C7B;&#x5BF9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x505A;&#x89E3;&#x91CA;&#xFF0C;&#x4F8B;&#x5982; LinkedList &#x5BF9;&#x4E8E;&#x94FE;&#x8868;&#x7684;&#x5B9E;&#x73B0;</p>
<h1 id="&#x7406;&#x89E3;">&#x7406;&#x89E3;</h1>
<p>&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#xFF0C;&#x6240;&#x5904;&#x7406;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#x3001;&#x5B58;&#x50A8;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x7ED3;&#x6784;&#x5C31;&#x662F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x8BFB;&#x53D6;&#x3001;&#x4FEE;&#x6539;&#xFF09;&#xFF0C;&#x5E7F;&#x4E49;&#x4E0A;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x901F;&#x5EA6;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x5B58;&#x5728; <strong>&#x6570;&#x636E;&#x5143;&#x7D20;</strong> &#x4E0E; <strong>&#x6570;&#x636E;&#x9879;</strong> &#x7684;&#x6982;&#x5FF5;&#x3002;&#x6570;&#x636E;&#x5143;&#x7D20;&#x662F;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x7684;&#x57FA;&#x672C;&#x7EC4;&#x6210;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7531;&#x82E5;&#x5E72;&#x4E2A;&#x6570;&#x636E;&#x9879;&#x7EC4;&#x6210;&#xFF0C;&#x6570;&#x636E;&#x9879;&#x662F;&#x4E0D;&#x53EF;&#x5207;&#x5206;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#x3002;&#x4EE5;&#x4EBA;&#x7FA4;&#x4E3A;&#x4F8B;&#xFF0C;&#x4EBA;&#x7FA4;&#x662F;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x4EBA;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6570;&#x636E;&#x5143;&#x7D20;&#xFF0C;&#x4EBA;&#x7684;&#x59D3;&#x540D;&#x3001;&#x5E74;&#x9F84;&#x5C31;&#x662F;&#x6570;&#x636E;&#x9879;&#x3002;<strong>&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E0E;&#x6570;&#x636E;&#x9879;&#x7684;&#x5212;&#x5206;&#xFF0C;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x7684;&#x573A;&#x666F;</strong>&#x3002;&#x82E5;&#x5C06;&#x4EBA;&#x4F5C;&#x4E3A;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x5143;&#x7D20;&#x3001;&#x6570;&#x636E;&#x9879;&#x53C8;&#x53EF;&#x4EE5;&#x968F;&#x4E4B;&#x6539;&#x53D8;</p>
<p>&#x8FD8;&#x9700;&#x8981;&#x7406;&#x89E3;&#x7684;&#x662F;&#xFF0C;<strong>&#x6570;&#x636E;&#x7ED3;&#x6784;</strong>&#x4E0E;<strong>&#x6570;&#x636E;&#x5BF9;&#x8C61;</strong>&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6307;&#x7684;&#x662F;&#xFF1A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5B58;&#x5728;&#x7684;&#x7279;&#x5B9A;&#x8054;&#x7CFB;&#xFF1B;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x6307;&#x7684;&#x662F;&#xFF1A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5B58;&#x5728;&#x7684;&#x76F8;&#x4F3C;&#x7279;&#x5F81;&#x3002;&#x542C;&#x8D77;&#x6765;&#xFF0C;&#x4E8C;&#x8005;&#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5C31;&#x770B;&#x5177;&#x4F53;&#x7684;&#x5212;&#x5206;&#x573A;&#x666F;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x8FD9;&#x4E9B;&#x76F8;&#x4F3C;&#x4E14;&#x6A21;&#x7CCA;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E86;&#x89E3;&#x5373;&#x53EF;&#xFF0C;&#x65E0;&#x987B;&#x6DF1;&#x7A76;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x4E2D;&#x5FC3;&#xFF0C;&#x53EA;&#x80FD;&#x7B97;&#x662F;&#x5F00;&#x80C3;&#x5C0F;&#x83DC;&#x3002;&#x5168;&#x6587;&#xFF0C;&#x7406;&#x89E3;&#x7684;<strong>&#x6570;&#x636E;&#x4EE5;&#x4F55;&#x79CD;&#x7684;&#x7ED3;&#x6784;&#x3001;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x4E2D;</strong></p>
<p>&#x6570;&#x636E;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x9700;&#x8981;&#x4ECE;&#x4E09;&#x4E2A;&#x65B9;&#x5411;&#x8003;&#x8651;&#xFF0C;&#x91CD;&#x70B9;&#x662F;&#x903B;&#x8F91;&#x7ED3;&#x6784;</p>
<ol>
<li>&#x903B;&#x8F91;&#x7ED3;&#x6784;</li>
<li>&#x5B58;&#x50A8;&#x7ED3;&#x6784;</li>
<li>&#x6570;&#x636E;&#x8FD0;&#x7B97;</li>
</ol>
<p>&#x5BF9;&#x4E8E;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;&#x96C6;&#x5408;&#x3001;&#x7EBF;&#x6027;&#x8868;&#x3001;&#x6811;&#x3001;&#x56FE;&#x56DB;&#x7C7B;&#x3002;&#x800C;&#x96C6;&#x5408;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x6240;&#x4EE5;&#x7F29;&#x51CF;&#x4E3A;&#x4E24;&#x7C7B;&#xFF0C;&#x7EBF;&#x6027;&#x8868;&#x3001;&#x975E;&#x7EBF;&#x6027;&#x8868;&#xFF0C;&#x793A;&#x610F;&#x56FE;&#x5982;&#x4E0B;</p>
<p><img src="https://p9-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/948d758854e741a7957dbebabc939504~tplv-k3u1fbpfcp-watermark.image" alt="&#x903B;&#x8F91;&#x7ED3;&#x6784;.jpg"></p>
<p>&#x7EBF;&#x6027;&#x8868;&#xFF0C;&#x662F;&#x4EE5;&#x4E00;&#x6761;&#x7EBF;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x5B58;&#x5728;&#x524D;&#x9A71;&#x548C;&#x540E;&#x7EE7;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x4E0A;&#x4E00;&#x8282;&#x70B9;&#x662F;&#x4E0B;&#x4E00;&#x8282;&#x70B9;&#x7684;&#x524D;&#x9A71;&#x5143;&#x7D20;&#xFF0C;&#x4E0B;&#x4E00;&#x8282;&#x70B9;&#x662F;&#x4E0A;&#x4E00;&#x8282;&#x70B9;&#x7684;&#x540E;&#x7EE7;&#x5143;&#x7D20;</p>
<p>&#x6811;&#xFF0C;&#x4EE5;&#x73B0;&#x5B9E;&#x4E2D;&#x6811;&#x7684;&#x5206;&#x53C9;&#x800C;&#x5C55;&#x793A;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5B58;&#x5728;&#x552F;&#x4E00;&#x7684;&#x6839;&#x5143;&#x7D20;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x6700;&#x9AD8;&#x7236;&#x5143;&#x7D20;&#xFF0C;&#x5176;&#x540E;&#x5206;&#x53C9;&#x7684;&#x5143;&#x7D20;&#x79F0;&#x4E3A;&#x5B50;&#x5143;&#x7D20;</p>
<p>&#x56FE;&#xFF0C;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x662F;&#x591A;&#x5BF9;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#x6307;&#x5411;&#xFF0C;&#x4E0E;&#x4E4B;&#x524D;&#x7684;&#x7EBF;&#x6027;&#x8868;&#x3001;&#x6811;&#x5B58;&#x5728;&#x660E;&#x663E;&#x7684;&#x4E0D;&#x540C;</p>
<p>&#x5BF9;&#x4E8E;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5728;&#x7269;&#x7406;&#x5B58;&#x50A8;&#x4E0A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4E4B;&#x524D;&#x7684;&#x903B;&#x8F91;&#x7ED3;&#x6784;&#x662F;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#x3001;&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#x3001;&#x7D22;&#x5F15;&#x5B58;&#x50A8;&#x3001;&#x6563;&#x5217;&#x5B58;&#x50A8;</p>
<p>&#x518D;&#x63D0;&#x4E00;&#x904D;&#xFF0C;<strong>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6307;&#x7684;&#x662F;&#x6570;&#x636E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x7ED3;&#x6784;&#x3001;&#x5F62;&#x5F0F;</strong>&#xFF0C;&#x8FD9;&#x6709;&#x5229;&#x4E8E;&#x7406;&#x89E3;&#x5B58;&#x50A8;&#x7ED3;&#x6784;&#xFF0C;&#x5373;&#x7269;&#x7406;&#x5B58;&#x50A8;</p>
<p><img src="https://p1-juejin.byteimg.com/tos-cn-i-k3u1fbpfcp/f9c1cd63e71f4950ad8d5cc44bf36bd4~tplv-k3u1fbpfcp-watermark.image" alt="&#x5B58;&#x50A8;&#x7ED3;&#x6784;.jpg"></p>
<p>&#x987A;&#x5E8F;&#x5B58;&#x50A8;&#xFF1A;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5B58;&#x50A8;&#xFF0C;&#x6570;&#x636E;&#x5143;&#x7D20;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x5757;&#x7A7A;&#x95F4;&#x4E2D;&#xFF0C;&#x7269;&#x7406;&#x4E0A;&#x662F;&#x8FDE;&#x7EED;&#x7684;</p>
<p>&#x94FE;&#x5F0F;&#x5B58;&#x50A8;&#xFF1A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#xFF0C;&#x65E0;&#x987B;&#x4FDD;&#x8BC1;&#x7269;&#x7406;&#x4E0A;&#x7684;&#x8FDE;&#x7EED;&#xFF0C;&#x5404;&#x4E2A;&#x5143;&#x7D20;&#x4E4B;&#x524D;&#x901A;&#x8FC7;&#x6307;&#x9488;&#x6307;&#x5411;</p>
<p>&#x7D22;&#x5F15;&#x5B58;&#x50A8;&#xFF1A;&#x5B58;&#x5728;&#x4E00;&#x5F20;&#x7D22;&#x5F15;&#x8868;&#xFF0C;&#x8BE5;&#x7D22;&#x5F15;&#x8868;&#x4E2D;&#x5B58;&#x50A8;&#x7740;&#x5176;&#x5B83;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x6307;&#x5411;&#x5185;&#x5B58;&#x5730;&#x5740;</p>
<p>&#x6563;&#x5217;&#x5B58;&#x50A8;&#x6682;&#x4E0D;&#x4ECB;&#x7ECD;&#xFF0C;&#x8FD9;&#x6D89;&#x53CA;&#x5230;&#x4E86;&#x54C8;&#x5E0C;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x53C2;&#x8003; HashMap</p>
<p>&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x8FD0;&#x7B97;&#xFF0C;&#x4E5F;&#x4E0D;&#x505A;&#x4ECB;&#x7ECD;&#x3002;&#x901A;&#x8FC7;&#x5B9E;&#x9645;&#x7684; Java &#x5BB9;&#x5668;&#x7C7B;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x771F;&#x6B63;&#x7684;&#x7406;&#x89E3;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x610F;&#x4E49;</p>
<footer class="page-footer"><span class="copyright">Mr.Zhou Blog - GitHub Pages</span><span class="footer-modification">Last updated at&#xFF1A;
2021-06-08 16:49:57
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../" class="navigation navigation-prev navigation-unique" aria-label="Previous page: wyfyjc.com">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"手搓数据结构","level":"2.1","depth":1,"previous":{"title":"wyfyjc.com","level":"1.1","depth":1,"path":"README.md","ref":"./README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","search-pro","expandable-chapters","chapter-fold","splitter","back-to-top-button","hide-element","tbfed-pagefooter","favicon","insert-logo","todos","intopic-toc","nvigation","recently-updated","livereload"],"styles":{"website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Mr.Zhou Blog - GitHub Pages","modify_label":"Last updated at：","modify_format":"YYYY-MM-DD HH:mm:ss"},"chapter-fold":{},"intopic-toc":{"isCollapsed":true,"isScrollspyActive":true,"label":"章节目录","maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"livereload":{},"splitter":{},"search-pro":{},"search":{},"todos":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"nvigation":{"navigatorList":[{"name":"Google 搜索","url":"https://www.google.com/"},{"name":"GitHub","url":"https://github.com/"},{"name":"GitHub 镜像","url":"https://hub.fastgit.org/"},{"name":"老马说编程","url":"https://www.cnblogs.com/swiftma/p/5631311.html"},{"name":"Rust 中文","url":"https://kaisery.github.io/trpl-zh-cn/"},{"name":"语言规范","url":"https://docs.oracle.com/javase/specs/jls/se11/html/index.html"},{"name":"虚拟机规范","url":"https://docs.oracle.com/javase/specs/jvms/se11/html/index.html"},{"name":"Spring 生态","url":"https://spring.io/projects"},{"name":"Stack Overflow","url":"https://stackoverflow.com/"},{"name":"维基百科","url":"https://www.wikipedia.org/"},{"name":"哔哩哔哩","url":"https://www.bilibili.com/"}]},"hide-element":{"elements":[".gitbook-link",".navigation",".navigation-prev",".book-header",".divider"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"./styles/GitHub.png","bookmark":"./styles/GitHub.png","appleTouch":"./styles/GitHub.png","appleTouchMore":{"120x120":"./styles/GitHub.png","180x180":"./styles/GitHub.png"}},"recently-updated":{},"back-to-top-button":{},"links":{"sidebar":{"Home":"https://wyfyjc.com"}},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"style":"width: 90%;","url":"/styles/雪湖.jpg"},"expandable-chapters":{}},"theme":"default","author":"周默","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Mr.Zhou","language":"zh-hans","gitbook":"*","description":"惟愿风雨兼程，路尽仍显峥嵘！"},"file":{"path":"手搓数据结构/README.md","mtime":"2021-06-08T08:49:57.250Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-06-08T08:50:14.830Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-nvigation/nav.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

